.. _bsn_userguide:

BSN Strings
============

Introduction
------------

The function :func:`clean_nl_bsn() <dataprep.clean.clean_nl_bsn.clean_nl_bsn>` cleans a column containing Burgerservicenummer (BSN, the Dutch citizen identification number) strings, and standardizes them in a given format. The function :func:`validate_nl_bsn() <dataprep.clean.clean_nl_bsn.validate_nl_bsn>` validates either a single BSN strings, a column of BSN strings or a DataFrame of BSN strings, returning `True` if the value is valid, and `False` otherwise.

BSN strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "111222333"
* `standard`: BSN strings with proper whitespace in the proper places, like "1112.22.333"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_nl_bsn()` and `validate_nl_bsn()`.

### An example dataset containing BSN strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "bsn": [
            "111222333",
            "1112223334",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

              bsn                                           address
0       111222333                                     123 Pine Ave.
1      1112223334                                           main st
2     51824753556                      1234 west main heights 57033
3  51 824 753 556                    apt 1 789 s maple rd manhattan
4           hello                robie house, 789 north main street
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles
6            NULL                                             hello

## 1. Default `clean_nl_bsn`

By default, `clean_nl_bsn` will clean bsn strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_nl_bsn
clean_nl_bsn(df, column = "bsn")

,bsn,address,bsn_clean
0,111222333,123 Pine Ave.,1112.22.333
1,1112223334,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_nl_bsn(df, column = "bsn", output_format="standard")

,bsn,address,bsn_clean
0,111222333,123 Pine Ave.,1112.22.333
1,1112223334,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_nl_bsn(df, column = "bsn", output_format="compact")

              bsn                                           address  bsn_clean
0       111222333                                     123 Pine Ave.  111222333
1      1112223334                                           main st        NaN
2     51824753556                      1234 west main heights 57033        NaN
3  51 824 753 556                    apt 1 789 s maple rd manhattan        NaN
4           hello                robie house, 789 north main street        NaN
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles        NaN
6            NULL                                             hello        NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned BSN strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_nl_bsn(df, column="bsn", inplace=True)

     bsn_clean                                           address
0  1112.22.333                                     123 Pine Ave.
1          NaN                                           main st
2          NaN                      1234 west main heights 57033
3          NaN                    apt 1 789 s maple rd manhattan
4          NaN                robie house, 789 north main street
5          NaN  (staples center) 1111 S Figueroa St, Los Angeles
6          NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_nl_bsn(df, "bsn", errors="coerce")

,bsn,address,bsn_clean
0,111222333,123 Pine Ave.,1112.22.333
1,1112223334,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_nl_bsn(df, "bsn", errors="ignore")

,bsn,address,bsn_clean
0,111222333,123 Pine Ave.,1112.22.333
1,1112223334,main st,1112223334
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_nl_bsn()`

`validate_nl_bsn()` returns `True` when the input is a valid BSN. Otherwise it returns `False`.

The input of `validate_nl_bsn()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_nl_bsn()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_nl_bsn()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_nl_bsn
print(validate_nl_bsn("111222333"))
print(validate_nl_bsn("1112223334"))
print(validate_nl_bsn("51824753556"))
print(validate_nl_bsn("51 824 753 556"))
print(validate_nl_bsn("hello"))
print(validate_nl_bsn(np.nan))
print(validate_nl_bsn("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_nl_bsn(df["bsn"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: bsn, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_nl_bsn(df, column="bsn")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: bsn, dtype: bool

### Only DataFrame

In [11]:
validate_nl_bsn(df)

     bsn  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False